dick= {"Первая четверть:": int(0), "Вторая четверть:":int(0), "Третья четверть:": int(0), "Четвертая четверть:":int(0)}
for i in range(0,int(input())):
    a=str(input())
    x,y = a.split(" ")
    x, y=int(x), int(y)
    if x > 0:
        if y > 0:
            dick["Первая четверть:"] += 1
        if y < 0:
            dick["Четвертая четверть:"] += 1
    if x < 0:
        if y > 0:
            dick["Вторая четверть:"] += 1
        if y < 0:
            dick["Третья четверть:"] += 1

print("Первая четверть:", dick["Первая четверть:"])
print("Вторая четверть:", dick["Вторая четверть:"])
print("Третья четверть:", dick["Третья четверть:"])
print("Четвертая четверть:", dick["Четвертая четверть:"])
